Revit 2027 API
PerformanceAdviser.GetRuleId Method
 Retrieves an id of a rule for a given index in the list.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public PerformanceAdviserRuleId GetRuleId(
	int index
)
Public Function GetRuleId (
	index As Integer
) As PerformanceAdviserRuleId
public:
PerformanceAdviserRuleId^ GetRuleId(
	int index
)
member GetRuleId :
        index : int -> PerformanceAdviserRuleId
Parameters
index Int32
 The index to retrieve the rule id for.
Return Value
PerformanceAdviserRuleId
 The rule id.
Exceptions
Exception | Condition
ArgumentException |  The index is outside of acceptable range.
See Also
Reference
PerformanceAdviser Class
Autodesk.Revit.DB Namespace